'''
#---------------------------------------------------------------------------------------------------
# 실습 0: 교과서 예제
#----------------------------------------------------------------------------------------------------
print("본 프로그램은 섭씨온도를 화씨온도로 변환하는 프로그램입니다.")
print("변환하고 싶은 섭씨온도를 입력하세요.")

celsius = input()
fahrenheit = (float(celsius) * 1.8 ) + 32

print("섭씨온도:", celsius)
print("화씨온도:", fahrenheit)

exit(0)
'''

#----------------------------------------------------------------------------------------------------
# 실습 1: 변형예제
# input() 함수는 문자열을 출력할 수 있다.
#----------------------------------------------------------------------------------------------------
print("본 프로그램은 섭씨온도를 화씨온도로 변환하는 프로그램입니다.")
#print("변환하고 싶은 섭씨온도를 입력하세요.")

celsius = input("변환하고 싶은 섭씨온도: ")       # 99를 입력해 보세요...
fahrenheit = (float(celsius) * 1.8 ) + 32

print("섭씨온도:", celsius)
print("화씨온도:", fahrenheit)
print(f"화씨온도: {fahrenheit:#.2f}")

exit(0)

